Ran Plan for 2 projects:

1. dir: `external/iac/homelab/ec2/frp-server` workspace: `default`
1. dir: `external/iac/homelab/sg/netmaker` workspace: `default`

### 1. dir: `external/iac/homelab/ec2/frp-server` workspace: `default`
<details><summary>Show Output</summary>

```diff
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching ">= 4.20.0"...
- Using hashicorp/aws v4.55.0 from the shared cache directory

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

╷
│ Warning: Incomplete lock file information for providers
│ 
│ Due to your customized provider installation methods, Terraform was forced
│ to calculate lock file checksums locally for the following providers:
│   - hashicorp/aws
│ 
│ The current .terraform.lock.hcl file only includes checksums for
│ linux_amd64, so Terraform running on another platform will fail to install
│ these providers.
│ 
│ To calculate additional checksums for another platform, run:
│   terraform providers lock -platform=linux_amd64
│ (where linux_amd64 is the platform to generate)
╵

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
Acquiring state lock. This may take a few moments...
data.aws_ssm_parameter.this[0]: Reading...
data.aws_partition.current: Reading...
data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_ssm_parameter.this[0]: Read complete after 1s [id=/aws/service/ami-amazon-linux-latest/amzn2-ami-hvm-x86_64-gp2]
aws_instance.this[0]: Refreshing state... [id=i-0240b88b513791aca]
aws_eip.this: Refreshing state... [id=eipalloc-01b4673b815ad8336]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eip.this will be updated in-place
  ~ resource "aws_eip" "this" {
        id                   = "eipalloc-01b4673b815ad8336"
      ~ instance             = "i-0240b88b513791aca" -> (known after apply)
      ~ network_interface    = "eni-06109668ad1f5057d" -> (known after apply)
        tags                 = {}
        # (11 unchanged attributes hidden)
    }

  # aws_instance.this[0] must be replaced
-/+ resource "aws_instance" "this" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ ami                                  = (sensitive value)
      ~ arn                                  = "arn:aws:ec2:ap-southeast-1:370400765644:instance/i-0240b88b513791aca" -> (known after apply)
      ~ availability_zone                    = "ap-southeast-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0240b88b513791aca" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-06109668ad1f5057d" -> (known after apply)
      ~ private_dns                          = "ip-10-0-50-178.ap-southeast-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.50.178" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "3.1.92.227" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Environment" = "homelab"
            "Name"        = ""
            "Owner"       = "linhng98"
            "Terraform"   = "true"
        }
      ~ tags_all                             = {
          ~ "Name"        = "" -> (known after apply)
            # (3 unchanged elements hidden)
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "d6d02dcb72643da6189e0cd0eb19958c3e476a75" -> "bccf74e47f9a061f311a491e3870d78d543bb59e" # forces replacement
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          + "sg-02c327b0587ec664d",
            # (4 unchanged elements hidden)
        ]
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      ~ credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-00eb53b46318b487a" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ arn                                = "arn:aws:ec2:ap-southeast-1:370400765644:instance/i-0240b88b513791aca" -> (known after apply)
  ~ capacity_reservation_specification = [
      - {
          - capacity_reservation_preference = "open"
          - capacity_reservation_target     = []
        },
    ] -> (known after apply)
  ~ id                                 = "i-0240b88b513791aca" -> (known after apply)
  ~ instance_state                     = "running" -> (known after apply)
  ~ ipv6_addresses                     = [] -> (known after apply)
  + outpost_arn                        = (known after apply)
  + password_data                      = (known after apply)
  ~ primary_network_interface_id       = "eni-06109668ad1f5057d" -> (known after apply)
  ~ private_dns                        = "ip-10-0-50-178.ap-southeast-1.compute.internal" -> (known after apply)
  ~ private_ip                         = "10.0.50.178" -> (known after apply)
  + public_dns                         = (known after apply)
  ~ public_ip                          = "3.1.92.227" -> (known after apply)
  ~ tags_all                           = {
      - "Environment" = "homelab"
      - "Name"        = ""
      - "Owner"       = "linhng98"
      - "Terraform"   = "true"
    } -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /atlantis-data/repos/linhng98/mess-around/64/default/external/iac/homelab/ec2/frp-server/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/atlantis-data/repos/linhng98/mess-around/64/default/external/iac/homelab/ec2/frp-server/default.tfplan"
Releasing state lock. This may take a few moments...
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d external/iac/homelab/ec2/frp-server`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.homelab.linhng98.com/lock?id=linhng98%252Fmess-around%252Fexternal%252Fiac%252Fhomelab%252Fec2%252Ffrp-server%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d external/iac/homelab/ec2/frp-server`
</details>
Plan: 1 to add, 1 to change, 1 to destroy.

---
### 2. dir: `external/iac/homelab/sg/netmaker` workspace: `default`
```diff
aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-02c327b0587ec664d]
aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3760005960]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
Releasing state lock. This may take a few moments...
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d external/iac/homelab/sg/netmaker`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.homelab.linhng98.com/lock?id=linhng98%252Fmess-around%252Fexternal%252Fiac%252Fhomelab%252Fsg%252Fnetmaker%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d external/iac/homelab/sg/netmaker`

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`